import math
b = int(input())             #Первое задание
h = int(input())
s = (b*h)/2
print (s)
'''a = int(input("Введите сторону: "))             #второе задание
b = int(input("Введите вторую сторону: "))
c = int(input("Введите третью сторону: "))
p = (a + b + c) / 2
s = math.sqrt (p * (p - a) * (p - b) * (p - c))
print (s)'''
'''t = 5 == 5                                       #третье задание
print(t)

print(f"Програмировать очень интересно. Ведь только в программировании можно сложить правду с правдой и получить правду {t+t}.")'''
