'''Написать программу, которая считает сумму чисел от 1 до 20 (включительно) 
Написать программу, которая считает сумму всех нечетных чисел от 0 до 10.
Написать программу, которая пишет "hello", пока не получит в ответ "bye".'''
'''num = 1
summa = 1 
while num <= 19:
    num = num + 1
    summa = summa + num
    if num == 20:
        print (summa)'''

'''num = 0
summa = 0 
while num <= 9:
    
    num = num + 1
    if (num % 2) > 0: 
        summa = summa + num
    if num == 10 :
        print (summa)'''

    
    



